Tekla Open API Reference for Tekla Structures 2025
Angle.CurrentUnitType Property
 Gets or sets the Tekla Structures current angle type
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Angle.UnitType CurrentUnitType { get; set; }
Public Shared Property CurrentUnitType As Angle.UnitType
	Get
	Set
Property Value
Type: Angle.UnitType
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace